[
  {
    "id": "121501497",
    "title": "Study Buddy",
    "link": "https://github.com/Kamil-Budzik/adv-study-buddy",
    "live": "https://github.com/Kamil-Budzik/adv-study-buddy",
    "image": {
      "url": "https://www.datocms-assets.com/64388/1651770227-dziennnik_mock_up_jpg.jpg"
    },
    "description": "<p>It is an electronic diary that teachers can use to organize their&nbsp;<br />students. The user can modify classes, notes, and students with&nbsp;<br />pop-up modals. Every single feature in this app was tested with&nbsp;<br />React Testing Library or Cypress.</p>"
  },
  {
    "id": "113965123",
    "title": "Rick and Morty",
    "link": "https://github.com/Kamil-Budzik/Rick-and-Morty",
    "live": "https://kamil-budzik.github.io/Rick-and-Morty/#/",
    "image": {
      "url": "https://www.datocms-assets.com/64388/1651747130-rick_and_morty_website_jpg.jpg"
    },
    "description": "<ul dir=\"auto\">\n  <li>I created the application because I wanted to learn different ways of fetching data in react. I had never used react-query before so that's why I decided to use it here. I learnt a lot about react-query. At this moment I can fetch, cache, and update data in my applications without a global state. I realized how good is this tool and for sure I will use it in the future.</li>\n</ul>"
  },
  {
    "id": "114784196",
    "title": "Weather API",
    "link": "https://github.com/Kamil-Budzik/Weather-App",
    "live": "https://kamil-budzik.github.io/Weather-App/",
    "image": {
      "url": "https://www.datocms-assets.com/64388/1651746777-weather_app_mockup_jpg.jpg"
    },
    "description": "<p>This project was built with quite an advanced meta-weather API. My folder structure was based on atomic design. To handle state I used redux with redux-thunk. At this moment I would use redux-toolkit or react-query but I want to show you that I can also work with older technologies.</p>"
  },
  {
    "id": "114047385",
    "title": "Fylo Landing Page",
    "link": "https://github.com/Kamil-Budzik/fylo-dark-theme",
    "live": "fylo-dark-theme-tawny.vercel.app",
    "image": {
      "url": "https://www.datocms-assets.com/64388/1651746747-fylo_mockup_jpg.jpg"
    },
    "description": "<p>This project is a challenge from Frontend Mentor. It's a fully responsive project thanks to the flexbox and grid. Because of SVG icons, I had a lot of work with advanced responsible styles. Built with next and styled-components.</p>"
  },
  {
    "id": "114784307",
    "title": "Edie homepage",
    "link": "https://github.com/Kamil-Budzik/Edie-homepage",
    "live": "https://kamil-budzik.github.io/Edie-homepage/",
    "image": {
      "url": "https://www.datocms-assets.com/64388/1651746643-mockup_1-jpegh.jpg"
    },
    "description": "<p>The project was built a long time ago at the beginning of my front-end passion. When I was making this project I didn't know how to use any kind of compiler so that's why I have few CSS files. All in all, I created this fully responsible project only using flexbox and media queries so that's why I think it's worth showing it.</p>"
  },
  {
    "id": "114784133",
    "title": "Github Jobs",
    "link": "https://github.com/DonquixoteSabo/Github-Jobs",
    "live": "https://donquixotesabo.github.io/Github-Jobs/",
    "image": {
      "url": "https://www.datocms-assets.com/64388/1646804597-jobs.png"
    },
    "description": "<p>In the beginning, this site was using GitHub API. Unluckily, this API is no longer available so I was forced to use some kind of service worker to mock the data. That's why this project doesn't work on the production.<br />To check this project and run all tests you have to copy this repo. For this project, I used typescript, Mock Service Worker, RTK Query, and so on.</p>"
  }
]